Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: قد علمنا ما تنقص الأرض منهم وعندنا كتاب حفيظ
en: We know that which the earth taketh of them, and with Us is a recording Book.

source: بل كذبوا بالحق لما جاءهم فهم في أمر مريج
en: Nay, but they have denied the truth when it came unto them, therefor they are now in troubled case.

source: أفلم ينظروا إلى السماء فوقهم كيف بنيناها وزيناها وما لها من فروج
en: Have they not then observed the sky above them, how We have constructed it and beautified it, and how there are no rifts therein?

source: والأرض مددناها وألقينا فيها رواسي وأنبتنا فيها من كل زوج بهيج
en: And the earth have We spread out, and have flung firm hills therein, and have caused of every lovely kind to grow thereon,

source: تبصرة وذكرى لكل عبد منيب
en: A vision and a reminder for every penitent slave.

source: ونزلنا من السماء ماء مباركا فأنبتنا به جنات وحب الحصيد
en: And We send down from the sky blessed water whereby We give growth unto gardens and the grain of crops,

source: والنخل باسقات لها طلع نضيد
en: And lofty date-palms with ranged clusters,

source: رزقا للعباد وأحيينا به بلدة ميتا كذلك الخروج
en: Provision (made) for men; and therewith We quicken a dead land. Even so will be the resurrection of the dead.

source: كذبت قبلهم قوم نوح وأصحاب الرس وثمود
en: The folk of Noah denied (the truth) before them, and (so did) the dwellers at Ar-Rass and (the tribe of) Thamud,

source: وعاد وفرعون وإخوان لوط
en: And (the tribe of) A'ad, and Pharaoh, and the brethren of Lot,

source: وأصحاب الأيكة وقوم تبع كل كذب الرسل فحق وعيد
en: And the dwellers in the wood, and the folk of Tubb'a: every one denied their messengers, therefor My threat took effect.

source: أفعيينا بالخلق الأول بل هم في لبس من خلق جديد
en: Were We then worn out by the first creation? Yet they are in doubt about a new creation.

source: ولقد خلقنا الإنسان ونعلم ما توسوس به نفسه ونحن أقرب إليه من حبل الوريد
en: We verily created man and We know what his soul whispereth to him, and We are nearer to him than his jugular vein.

source: إذ يتلقى المتلقيان عن اليمين وعن الشمال قعيد
en: When the two Receivers receive (him), seated on the right hand and on the left,

source: ما يلفظ من قول إلا لديه رقيب عتيد
en: He uttereth no word but there is with him an observer ready.

source: وجاءت سكرة الموت بالحق ذلك ما كنت منه تحيد
en: And the agony of death cometh in truth. (And it is said unto him): This is that which thou wast wont to shun.

source: ونفخ في الصور ذلك يوم الوعيد
en: And the trumpet is blown. This is the threatened Day.

source: وجاءت كل نفس معها سائق وشهيد
en: And every soul cometh, along with it a driver and a witness.

source: لقد كنت في غفلة من هذا فكشفنا عنك غطاءك فبصرك اليوم حديد
en: (And unto the evil-doer it is said): Thou wast in heedlessness of this. Now We have removed from thee thy covering, and piercing is thy sight this day.

source: وقال قرينه هذا ما لدي عتيد
en: And (unto the evil-doer) his comrade saith: This is that which I have ready (as testimony).

source: ألقيا في جهنم كل كفار عنيد
en: (And it is said): Do ye twain hurl to hell each rebel ingrate,

source: مناع للخير معتد مريب
en: Hinderer of good, transgressor, doubter,

source: الذي جعل مع الله إلها آخر فألقياه في العذاب الشديد
en: Who setteth up another god along with Allah. Do ye twain hurl him to the dreadful doom.

source: قال قرينه ربنا ما أطغيته ولكن كان في ضلال بعيد
en: His comrade saith: Our Lord! I did not cause him to rebel, but he was (himself) far gone in error.

source: قال لا تختصموا لدي وقد قدمت إليكم بالوعيد
en: He saith: Contend not in My presence, when I had already proffered unto you the warning.

source: ما يبدل القول لدي وما أنا بظلام للعبيد
en: The sentence that cometh from Me cannot be changed, and I am in no wise a tyrant unto the slaves.

source: يوم نقول لجهنم هل امتلأت وتقول هل من مزيد
en: On the day when We say unto hell: Art thou filled? and it saith: Can there be more to come?

source: وأزلفت الجنة للمتقين غير بعيد
en: And the Garden is brought nigh for those who kept from evil, no longer distant.

source: هذا ما توعدون لكل أواب حفيظ
en: (And it is said): This is that which ye were promised. (It is) for every penitent and heedful one,

source: من خشي الرحمن بالغيب وجاء بقلب منيب
en: Who feareth the Beneficent in secret and cometh with a contrite heart.

source: ادخلوها بسلام ذلك يوم الخلود
en: Enter it in peace. This is the day of immortality.

source: لهم ما يشاءون فيها ولدينا مزيد
en: There they have all that they desire, and there is more with Us.

source: وكم أهلكنا قبلهم من قرن هم أشد منهم بطشا فنقبوا في البلاد هل من محيص
en: And how many a generation We destroyed before them, who were mightier than these in prowess so that they overran the lands! Had they any place of refuge (when the judgment came)?

source: إن في ذلك لذكرى لمن كان له قلب أو ألقى السمع وهو شهيد
en: Lo! therein verily is a reminder for him who hath a heart, or giveth ear with full intelligence.

source: ولقد خلقنا السماوات والأرض وما بينهما في ستة أيام وما مسنا من لغوب
en: And verily We created the heavens and the earth, and all that is between them, in six Days, and naught of weariness touched Us.

source: فاصبر على ما يقولون وسبح بحمد ربك قبل طلوع الشمس وقبل الغروب
en: Therefor (O Muhammad) bear with what they say, and hymn the praise of thy Lord before the rising and before the setting of the sun;

source: ومن الليل فسبحه وأدبار السجود
en: And in the night-time hymn His praise, and after the (prescribed) prostrations.

source: واستمع يوم يناد المناد من مكان قريب
en: And listen on the day when the crier crieth from a near place,

source: يوم يسمعون الصيحة بالحق ذلك يوم الخروج
en: The day when they will hear the (Awful) Cry in truth. That is the day of coming forth (from the graves).

source: إنا نحن نحيي ونميت وإلينا المصير
en: Lo! We it is Who quicken and give death, and unto Us is the journeying.

source: يوم تشقق الأرض عنهم سراعا ذلك حشر علينا يسير
en: On the day when the earth splitteth asunder from them, hastening forth (they come). That is a gathering easy for Us (to make).

source: نحن أعلم بما يقولون وما أنت عليهم بجبار فذكر بالقرآن من يخاف وعيد
en: We are Best Aware of what they say, and thou (O Muhammad) art in no wise a compeller over them. But warn by the Qur'an him who feareth My threat.

source: والذاريات ذروا
en: By those that winnow with a winnowing

source: فالحاملات وقرا
en: And those that bear the burden (of the rain)

source: فالجاريات يسرا
en: And those that glide with ease (upon the sea)

source: فالمقسمات أمرا
en: And those who distribute (blessings) by command,

source: إنما توعدون لصادق
en: Lo! that wherewith ye are threatened is indeed true,

source: وإن الدين لواقع
en: And lo! the judgment will indeed befall.

source: والسماء ذات الحبك
en: By the heaven full of paths,

source: إنكم لفي قول مختلف
en: Lo! ye, forsooth, are of various opinion (concerning the truth).

source: يؤفك عنه من أفك
en: He is made to turn away from it who is (himself) averse.

source: قتل الخراصون
en: Accursed be the conjecturers

source: الذين هم في غمرة ساهون
en: Who are careless in an abyss!

source: يسألون أيان يوم الدين
en: They ask: When is the Day of Judgment?

source: يوم هم على النار يفتنون
en: (It is) the day when they will be tormented at the Fire,

source: ذوقوا فتنتكم هذا الذي كنتم به تستعجلون
en: (And it will be said unto them): Taste your torment (which ye inflicted). This is what ye sought to hasten.

source: آخذين ما آتاهم ربهم إنهم كانوا قبل ذلك محسنين
en: Taking that which their Lord giveth them; for lo! aforetime they were doers of good;

source: كانوا قليلا من الليل ما يهجعون
en: They used to sleep but little of the night,

source: وبالأسحار هم يستغفرون
en: And ere the dawning of each day would seek forgiveness,

source: وفي أموالهم حق للسائل والمحروم
en: And in their wealth the beggar and the outcast had due share.

source: وفي الأرض آيات للموقنين
en: And in the earth are portents for those whose faith is sure.

source: وفي أنفسكم أفلا تبصرون
en: And (also) in yourselves. Can ye then not see?

source: وفي السماء رزقكم وما توعدون
en: And in the heaven is your providence and that which ye are promised;

source: فورب السماء والأرض إنه لحق مثل ما أنكم تنطقون
en: And by the Lord of the heavens and the earth, it is the truth, even as (it is true) that ye speak.

source: هل أتاك حديث ضيف إبراهيم المكرمين
en: Hath the story of Abraham's honoured guests reached thee (O Muhammad)?

source: إذ دخلوا عليه فقالوا سلاما قال سلام قوم منكرون
en: When they came in unto him and said: Peace! he answered, Peace! (and thought): Folk unknown (to me).

source: فراغ إلى أهله فجاء بعجل سمين
en: Then he went apart unto his housefolk so that they brought a fatted calf;

source: فقربه إليهم قال ألا تأكلون
en: And he set it before them, saying: Will ye not eat?

source: فأوجس منهم خيفة قالوا لا تخف وبشروه بغلام عليم
en: Then he conceived a fear of them. They said: Fear not! and gave him tidings of (the birth of) a wise son.

source: فأقبلت امرأته في صرة فصكت وجهها وقالت عجوز عقيم
en: Then his wife came forward, making moan, and smote her face, and cried: A barren old woman!

source: قالوا كذلك قال ربك إنه هو الحكيم العليم
en: They said: Even so saith thy Lord. Lo! He is the Wise, the Knower.

source: لنرسل عليهم حجارة من طين
en: That we may send upon them stones of clay,

source: مسومة عند ربك للمسرفين
en: Marked by thy Lord for (the destruction of) the wanton.

source: فأخرجنا من كان فيها من المؤمنين
en: Then we brought forth such believers as were there.

source: فما وجدنا فيها غير بيت من المسلمين
en: But We found there but one house of those surrendered (to Allah).

source: وتركنا فيها آية للذين يخافون العذاب الأليم
en: And We left behind therein a portent for those who fear a painful doom.

source: وفي موسى إذ أرسلناه إلى فرعون بسلطان مبين
en: And in Moses (too, there is a portent) when We sent him unto Pharaoh with clear warrant,

source: فتولى بركنه وقال ساحر أو مجنون
en: But he withdrew (confiding) in his might, and said: A wizard or a madman.

source: فأخذناه وجنوده فنبذناهم في اليم وهو مليم
en: So We seized him and his hosts and flung them in the sea, for he was reprobate.

source: وفي عاد إذ أرسلنا عليهم الريح العقيم
en: And in (the tribe of) A'ad (there is a portent) when we sent the fatal wind against them.

source: ما تذر من شيء أتت عليه إلا جعلته كالرميم
en: It spared naught that it reached, but made it (all) as dust.

source: وفي ثمود إذ قيل لهم تمتعوا حتى حين
en: And in (the tribe of) Thamud (there is a portent) when it was told them: Take your ease awhile.

source: فعتوا عن أمر ربهم فأخذتهم الصاعقة وهم ينظرون
en: But they rebelled against their Lord's decree, and so the thunderbolt overtook them even while they gazed;

source: فما استطاعوا من قيام وما كانوا منتصرين
en: And they were unable to rise up, nor could they help themselves.

source: وقوم نوح من قبل إنهم كانوا قوما فاسقين
en: And the folk of Noah aforetime. Lo! they were licentious folk.

source: والسماء بنيناها بأيد وإنا لموسعون
en: We have built the heaven with might, and We it is Who make the vast extent (thereof).

source: والأرض فرشناها فنعم الماهدون
en: And the earth have We laid out, how gracious is the Spreader (thereof)!

source: ومن كل شيء خلقنا زوجين لعلكم تذكرون
en: And all things We have created by pairs, that haply ye may reflect.

source: ففروا إلى الله إني لكم منه نذير مبين
en: Therefor flee unto Allah; lo! I am a plain warner unto you from him.

source: ولا تجعلوا مع الله إلها آخر إني لكم منه نذير مبين
en: And set not any other god along with Allah; lo! I am a plain warner unto you from Him.

source: كذلك ما أتى الذين من قبلهم من رسول إلا قالوا ساحر أو مجنون
en: Even so there came no messenger unto those before them but they said: A wizard or a madman!

source: أتواصوا به بل هم قوم طاغون
en: Have they handed down (the saying) as an heirloom one unto another? Nay, but they are froward folk.

source: فتول عنهم فما أنت بملوم
en: So withdraw from them (O Muhammad), for thou art in no wise blameworthy,

source: وذكر فإن الذكرى تنفع المؤمنين
en: And warn, for warning profiteth believers.

source: وما خلقت الجن والإنس إلا ليعبدون
en: I created the jinn and humankind only that they might worship Me.

source: ما أريد منهم من رزق وما أريد أن يطعمون
en: I seek no livelihood from them, nor do I ask that they should feed Me.

source: إن الله هو الرزاق ذو القوة المتين
en: Lo! Allah! He it is that giveth livelihood, the Lord of unbreakable might.

source: فإن للذين ظلموا ذنوبا مثل ذنوب أصحابهم فلا يستعجلون
en: And lo! for those who (now) do wrong there is an evil day like unto the evil day (which came for) their likes (of old); so let them not ask Me to hasten on (that day).

source: فويل للذين كفروا من يومهم الذي يوعدون
en: And woe unto those who disbelieve, from (that) their day which they are promised.

source: والطور
en: By the Mount,

source: وكتاب مسطور
en: And a Scripture inscribed

source: في رق منشور
en: On fine parchment unrolled,

source: والبيت المعمور
en: And the House frequented,

source: والسقف المرفوع
en: And the roof exalted,

source: والبحر المسجور
en: And the sea kept filled,

source: إن عذاب ربك لواقع
en: Lo! the doom of thy Lord will surely come to pass;

source: ما له من دافع
en: There is none that can ward it off.

source: يوم تمور السماء مورا
en: On the day when the heaven will heave with (awful) heaving,

source: وتسير الجبال سيرا
en: And the mountains move away with (awful) movement,

source: فويل يومئذ للمكذبين
en: Then woe that day unto the deniers

source: الذين هم في خوض يلعبون
en: Who play in talk of grave matters;

source: يوم يدعون إلى نار جهنم دعا
en: The day when they are thrust with a (disdainful) thrust, into the fire of hell

source: هذه النار التي كنتم بها تكذبون
en: (And it is said unto them): This is the Fire which ye were wont to deny.

source: أفسحر هذا أم أنتم لا تبصرون
en: Is this magic, or do ye not see?

source: اصلوها فاصبروا أو لا تصبروا سواء عليكم إنما تجزون ما كنتم تعملون
en: Endure the heat thereof, and whether ye are patient of it or impatient of it is all one for you. Ye are only being paid for what ye used to do.

source: إن المتقين في جنات ونعيم
en: Lo! those who kept their duty dwell in gardens and delight,

source: فاكهين بما آتاهم ربهم ووقاهم ربهم عذاب الجحيم
en: Happy because of what their Lord hath given them, and (because) their Lord hath warded off from them the torment of hell-fire.

source: كلوا واشربوا هنيئا بما كنتم تعملون
en: (And it is said unto them): Eat and drink in health (as a reward) for what ye used to do,

source: متكئين على سرر مصفوفة وزوجناهم بحور عين
en: Reclining on ranged couches. And we wed them unto fair ones with wide, lovely eyes.

source: والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم وما ألتناهم من عملهم من شيء كل امرئ بما كسب رهين
en: And they who believe and whose seed follow them in faith, We cause their seed to join them (there), and We deprive them of nought of their (life's) work. Every man is a pledge for that which he hath earned.

source: وأمددناهم بفاكهة ولحم مما يشتهون
en: And We provide them with fruit and meat such as they desire.

source: يتنازعون فيها كأسا لا لغو فيها ولا تأثيم
en: There they pass from hand to hand a cup wherein is neither vanity nor cause of sin.

source: ويطوف عليهم غلمان لهم كأنهم لؤلؤ مكنون
en: And there go round, waiting on them menservants of their own, as they were hidden pearls.

source: قالوا إنا كنا قبل في أهلنا مشفقين
en: Saying: Lo! of old, when we were with our families, we were ever anxious;

source: فمن الله علينا ووقانا عذاب السموم
en: But Allah hath been gracious unto us and hath preserved us from the torment of the breath of Fire.

source: إنا كنا من قبل ندعوه إنه هو البر الرحيم
en: Lo! we used to pray unto Him of old. Lo! He is the Benign, the Merciful.

source: فذكر فما أنت بنعمت ربك بكاهن ولا مجنون
en: Therefor warn (men, O Muhammad). By the grace of Allah thou art neither soothsayer nor madman.

source: أم يقولون شاعر نتربص به ريب المنون
en: Or say they: (he is) a poet, (one) for whom we may expect the accident of time?

source: قل تربصوا فإني معكم من المتربصين
en: Say (unto them): Except (your fill)! Lo! I am with you among the expectant.

source: أم تأمرهم أحلامهم بهذا أم هم قوم طاغون
en: Do their minds command them to do this, or are they an outrageous folk?

source: أم يقولون تقوله بل لا يؤمنون
en: Or say they: He hath invented it? Nay, but they will not believe!

source: فليأتوا بحديث مثله إن كانوا صادقين
en: Then let them produce speech the like thereof, if they are truthful.

source: أم خلقوا من غير شيء أم هم الخالقون
en: Or were they created out of naught? Or are they the creators?

source: أم خلقوا السماوات والأرض بل لا يوقنون
en: Or did they create the heavens and the earth? Nay, but they are sure of nothing!

source: أم عندهم خزائن ربك أم هم المصيطرون
en: Or do they own the treasures of thy Lord? Or have they been given charge (thereof)?

source: أم لهم سلم يستمعون فيه فليأت مستمعهم بسلطان مبين
en: Or have they any stairway (unto heaven) by means of which they overhear (decrees). Then let their listener produce some warrant manifest!

source: أم له البنات ولكم البنون
en: Or hath He daughters whereas ye have sons?

source: أم تسألهم أجرا فهم من مغرم مثقلون
en: Or askest thou (Muhammad) a fee from them so that they are plunged in debt?

source: أم عندهم الغيب فهم يكتبون
en: Or possess they the Unseen so that they can write (it) down?

source: أم يريدون كيدا فالذين كفروا هم المكيدون
en: Or seek they to ensnare (the messenger)? But those who disbelieve, they are the ensnared!

source: أم لهم إله غير الله سبحان الله عما يشركون
en: Or have they any god beside Allah? Glorified be Allah from all that they ascribe as partner (unto Him)!

source: وإن يروا كسفا من السماء ساقطا يقولوا سحاب مركوم
en: And if they were to see a fragment of the heaven falling, they would say: A heap of clouds.

source: فذرهم حتى يلاقوا يومهم الذي فيه يصعقون
en: Then let them be (O Muhammad), till they meet their day, in which they will be thunder-stricken,

source: يوم لا يغني عنهم كيدهم شيئا ولا هم ينصرون
en: A day in which their guile will naught avail them, nor will they be helped.

source: وإن للذين ظلموا عذابا دون ذلك ولكن أكثرهم لا يعلمون
en: And verily, for those who do wrong, there is a punishment beyond that. But most of them know not.

source: واصبر لحكم ربك فإنك بأعيننا وسبح بحمد ربك حين تقوم
en: So wait patiently (O Muhammad) for thy Lord's decree, for surely thou art in Our sight; and hymn the praise of thy Lord when thou uprisest,

source: ومن الليل فسبحه وإدبار النجوم
en: And in the night-time also hymn His praise, and at the setting of the stars.

source: والنجم إذا هوى
en: By the Star when it setteth,

source: ما ضل صاحبكم وما غوى
en: Your comrade erreth not, nor is deceived;

source: وما ينطق عن الهوى
en: Nor doth he speak of (his own) desire.

source: إن هو إلا وحي يوحى
en: It is naught save an inspiration that is inspired,

source: علمه شديد القوى
en: Which one of mighty powers hath taught him,

source: ذو مرة فاستوى
en: One vigorous; and he grew clear to view

source: وهو بالأفق الأعلى
en: When he was on the uppermost horizon.

source: ثم دنا فتدلى
en: Then he drew nigh and came down

source: فكان قاب قوسين أو أدنى
en: Till he was (distant) two bows' length or even nearer,

source: فأوحى إلى عبده ما أوحى
en: And He revealed unto His slave that which He revealed.

source: ما كذب الفؤاد ما رأى
en: The heart lied not (in seeing) what it saw.

source: أفتمارونه على ما يرى
en: Will ye then dispute with him concerning what he seeth?

source: ولقد رآه نزلة أخرى
en: And verily he saw him yet another time

source: عند سدرة المنتهى
en: By the lote-tree of the utmost boundary,

source: عندها جنة المأوى
en: Nigh unto which is the Garden of Abode.

source: إذ يغشى السدرة ما يغشى
en: When that which shroudeth did enshroud the lote-tree,

source: ما زاغ البصر وما طغى
en: The eye turned not aside nor yet was overbold.

source: لقد رأى من آيات ربه الكبرى
en: Verily he saw one of the greater revelations of his Lord.

source: أفرأيتم اللات والعزى
en: Have ye thought upon Al-Lat and Al-'Uzza

source: ومناة الثالثة الأخرى
en: And Manat, the third, the other?

source: ألكم الذكر وله الأنثى
en: Are yours the males and His the females?

source: تلك إذا قسمة ضيزى
en: That indeed were an unfair division!

source: إن هي إلا أسماء سميتموها أنتم وآباؤكم ما أنزل الله بها من سلطان إن يتبعون إلا الظن وما تهوى الأنفس ولقد جاءهم من ربهم الهدى
en: They are but names which ye have named, ye and your fathers, for which Allah hath revealed no warrant. They follow but a guess and that which (they) themselves desire. And now the guidance from their Lord hath come unto them.

source: أم للإنسان ما تمنى
en: Or shall man have what he coveteth?

source: فلله الآخرة والأولى
en: But unto Allah belongeth the after (life), and the former.

source: وكم من ملك في السماوات لا تغني شفاعتهم شيئا إلا من بعد أن يأذن الله لمن يشاء ويرضى
en: And how many angels are in the heavens whose intercession availeth naught save after Allah giveth leave to whom He chooseth and accepteth.

source: إن الذين لا يؤمنون بالآخرة ليسمون الملائكة تسمية الأنثى
en: Lo! it is those who disbelieve in the Hereafter who name the angels with the names of females.

source: وما لهم به من علم إن يتبعون إلا الظن وإن الظن لا يغني من الحق شيئا
en: And they have no knowledge thereof. They follow but a guess, and lo! a guess can never take the place of the truth.

source: فأعرض عن من تولى عن ذكرنا ولم يرد إلا الحياة الدنيا
en: Then withdraw (O Muhammad) from him who fleeth from Our remembrance and desireth but the life of the world.

source: ذلك مبلغهم من العلم إن ربك هو أعلم بمن ضل عن سبيله وهو أعلم بمن اهتدى
en: Such is their sum of knowledge. Lo! thy Lord is Best Aware of him who strayeth, and He is Best Aware of him whom goeth right.

source: ولله ما في السماوات وما في الأرض ليجزي الذين أساءوا بما عملوا ويجزي الذين أحسنوا بالحسنى
en: And unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth, that He may reward those who do evil with that which they have done, and reward those who do good with goodness.

source: الذين يجتنبون كبائر الإثم والفواحش إلا اللمم إن ربك واسع المغفرة هو أعلم بكم إذ أنشأكم من الأرض وإذ أنتم أجنة في بطون أمهاتكم فلا تزكوا أنفسكم هو أعلم بمن اتقى
en: Those who avoid enormities of sin and abominations, save the unwilled offences - (for them) lo! thy Lord is of vast mercy. He is Best Aware of you (from the time) when He created you from the earth, and when ye were hidden in the bellies of your mothers. Therefor ascribe not purity unto yourselves. He is Best Aware of him who wardeth off (evil).

source: أفرأيت الذي تولى
en: Didst thou (O Muhammad) observe him who turned away,

source: وأعطى قليلا وأكدى
en: And gave a little, then was grudging?

source: أعنده علم الغيب فهو يرى
en: Hath he knowledge of the Unseen so that he seeth?

source: أم لم ينبأ بما في صحف موسى
en: Or hath he not had news of what is in the books of Moses

source: وإبراهيم الذي وفى
en: And Abraham who paid his debt:

source: ألا تزر وازرة وزر أخرى
en: That no laden one shall bear another's load,

source: وأن ليس للإنسان إلا ما سعى
en: And that man hath only that for which he maketh effort,

source: وأن سعيه سوف يرى
en: And that his effort will be seen.

source: ثم يجزاه الجزاء الأوفى
en: And afterward he will be repaid for it with fullest payment;

source: وأن إلى ربك المنتهى
en: And that thy Lord, He is the goal;

source: وأنه هو أضحك وأبكى
en: And that He it is who maketh laugh, and maketh weep,

source: وأنه هو أمات وأحيا
en: And that He it is Who giveth death and giveth life;

source: وأنه خلق الزوجين الذكر والأنثى
en: And that He createth the two spouses, the male and the female,

source: من نطفة إذا تمنى
en: From a drop (of seed) when it is poured forth;

source: وأن عليه النشأة الأخرى
en: And that He hath ordained the second bringing forth;

source: وأنه هو أغنى وأقنى
en: And that He it is Who enricheth and contenteth;
